{
	"choose_language": "Тілді таңдаңыз",
	"language_set": "Сіз таңдаған тіл: {language}",
	"help": "Міне, қолжетімді командалар:\n/start - Ботты қайта іске қосу\n/help - Анықтама алу",
	"backQuestions": "Қандай тақырыпта көбірек білгіңіз келеді? \n1)FLL\n2)FTC",
	"startKey": {
		"button1": "FLL",
		"button2": "FTC"
	},
	"start": "Сәлеметсіз бе, сізбен байланыста – Uly Dala командасы! Біздің телеграм-ботты таныстыруға қуаныштымыз, ол FLL және FTC санаттарындағы командаларға көмектеседі. Мұнда сіз робототехника әлемі туралы ақпаратты ғана емес, сонымен қатар терең білім ала аласыз.\n\nБіздің команда бұған дейін FLL санатында қатысты және қазір FTC-де жетістіктерге жетуде. Біз өз тәжірибемізбен бөлісуге қуаныштымыз! Мұнда сіз таба аласыз:\n\n💡 Робот жасауға арналған пайдалы кеңестер\n📚 Маусым ережелері мен марапаттар санаттары туралы ақпарат\n🛠️ Бағдарламалау мен құрастыру бойынша нұсқаулықтар\n🌱 Инновациялық жоба идеялары\n🤝 Командалық жұмыс пен жарыстарға қатысу бойынша кеңестер\n\n🎯 Біздің мақсатымыз — бастаушы командаларды қолдау және олардың табысқа жетуіне көмектесу. Өйткені FIRST — бұл тек жарыс емес, бұл білім алу, шабыт және достық алаңы. Біз оның қаншалықты қиын екенін білеміз, бірақ берілмесеңіз әркім жеңімпаз бола алатынын жақсы білеміз! 🔥\n\n💬 Неге дәл “Uly Dala”?\nБұл жай атау ғана емес – бұл біздің философиямыз. “Ұлы Дала” – бұл еркіндік, білім және шексіз мүмкіндіктердің символы. Біз осы рухпен әр команда жаңа шыңдарға жете алады деп сенеміз!\n\n🔗 Неліктен біздің ботты пайдалану керек?\nБіз ең жақсы ресурстарды, сілтемелерді және кеңестерді жинадық – барлығы бір жерде! Сондай-ақ, біз ақпаратты үнемі жаңартып отырамыз, сондықтан әркім соңғы жаңалықтардан хабардар бола алады.\nБізбен бірге осы үлкен әлемнің бір бөлігі болыңыз! \n\n🏔Uly Dala сіздермен бірге табысқа жету жолында! 🏆\n\nКері байланыс:\n\nInstagram ulydala_.ftc https://www.instagram.com/ulydala_.ftc?igsh=MXhwbG9tbHlhZjJxNg== \n\nTikTok ulydala_ftc\nhttps://www.tiktok.com/@ulydala_ftc?_t=ZM-8t5av2S4rll&_r=1\n\nWebsite ULY DALA\nhttps://ulydalaftc.kz/",
	"FLL": "1) Бұл не? \n2) Марапаттар \n3) 2024-2025 маусымы туралы \n4) Роботқа арналған ресурстар \n5) Роботты қалай құрастыруға болады? \n6) Инновациялық жоба \n7) Бізден кеңестер",
	"FLLquestions": {
		"Бұл не?": "Біз FLL (FIRST LEGO League) туралы айтып бергіміз келеді — балалар мен жасөспірімдерге арналған халықаралық робототехника бағдарламасы, ол оқып-үйренуге, жасауға және технологиялар арқылы әлемді өзгертуге шабыт береді.\n\n🎯 FLL мақсаты:\n\nFLL балаларға робототехника мен инновация арқылы нақты мәселелерді шешуді үйретеді. Қатысушылар командада жұмыс істеп, LEGO-дан роботтар жасап, жобалар дайындап, қоршаған ортаны қорғау немесе адамдар өмірін жақсарту сияқты болашаққа қатысты тапсырмаларды шешуді үйренеді.\n\n🌍 Жарыстардың ауқымы:\n\nЖарыстар бүкіл әлемде өтеді 🌎. Бағдарламаға 110-нан астам ел қатысады! Бұл балалар мен жасөспірімдерге әртүрлі мәдениеттермен тәжірибе алмасуға және бірге жұмыс істеуді үйренуге мүмкіндік береді.\n\n🔵 Жарыс деңгейлері:\n• Аймақтық кезеңдер\n• Ұлттық чемпионаттар\n• Халықаралық жарыстар (World Festival)\n\n🚀 FLL-ге қатысу не үшін қажет?\n\nБіз FLL-ге қатысу болашаққа үлкен мүмкіндіктер беретініне сенеміз:\n✅ Техникалық дағдыларды дамыту — бағдарламалау, инженерия және дизайн.\n✅ Командалық жұмыс дағдылары — командада жұмыс істеуді және қақтығыстарды шешуді үйрену.\n✅ Шығармашылық ойлау — стандартты емес шешімдерді табу.\n✅ STEM мансабына дайындық — болашақ мамандықты таңдауға көмектеседі.\n✅ Networking — бүкіл әлемнен адамдармен танысу және пікірлес адамдарды табу.\n\n🔗 Пайдалы сілтемелер:\n1. FIRST ресми сайты — https://www.firstinspires.org\n2. FLL туралы ақпарат — https://www.firstinspires.org/robotics/fll\n3. Қатысушыларға арналған ресурстар мен материалдар — https://www.firstlegoleague.org\n\n💡 Бізден кеңес: Жобалық жұмыс пен жарыстарға белсенді қатысыңыз! Бұл дағдыларды жақсарту, әлем бойынша достар табу және оқу гранттарын алу мүмкіндігі.",
		"Марапаттар": "\nFIRST LEGO League (FLL) 2024-2025 \"Submerged\" маусымында командалар жарыстың әртүрлі аспектілерінде жетістіктерін көрсететін марапаттарға ұмтылады.\n\n🏆 FLL-дегі негізгі марапаттар:\n\n1. Чемпиондар марапаты 🥇\nБарлық салаларда керемет нәтижелер көрсеткен командаға беріледі: роботты жобалау, инновациялық жоба және негізгі құндылықтар.\n\n2. Робот өнімділігі марапаты 🤖\nРоботы ең көп ұпай жинаған команда мойындалады.\n\n3. Робот дизайны марапаты 🛠️\nРоботты жобалау мен бағдарламалауда керемет инновациялар мен стратегияларды көрсеткен команда марапатталады.\n\n4. Инновациялық жоба марапаты 💡\nМаусым тақырыбына байланысты нақты мәселелердің инновациялық шешімдері үшін беріледі.\n\n5. Негізгі құндылықтар марапаты 🌟\nFLL негізгі құндылықтарын ең жақсы көрсеткен командаларға беріледі: командалық жұмыс, кәсіпқойлық және көңілділік.\n\n6. Үздіксіздік марапаты 🚀\nЕлеулі кедергілерді жеңіп, айтарлықтай жетістіктерге жеткен командалар марапатталады.\n\n7. Инженерлік шеберлік марапаты 🏗️\nШешімдер мен шығармашылық тәсілдермен ерекшеленген командаларға беріледі.\n\n8. Мотивация марапаты 🎤\nБасқаларды шабыттандырған және STEM-ді өз қоғамдарында белсенді насихаттаған командалар мойындалады.\n\n9. Жаңа жұлдыз марапаты 🌠\nАлғашқы маусымында керемет нәтижелер көрсеткен жаңа командаларға беріледі.\n\n📘 Марапаттар туралы нұсқаулық:\n\nӘрбір марапаттың бағалау критерийлері мен процестері туралы толығырақ ақпарат алу үшін FLL ресми марапаттар нұсқаулығын қараңыз.\n\nАғымдағы ақпарат пен нұсқаулықтарды FIRST LEGO League ресми сайтынан таба аласыз:\nМаусымдық материалдар және ресурстар: https://www.firstlegoleague.org/season",
		"2024-2025 маусымы туралы": "🌊 FIRST LEGO League 2024-2025 маусымы — \n\nБұл маусым \"SUBMERGED\", яғни \"Суға бату\" деп аталады. Маусымда командалар суасты әлемін зерттеп, теңіз экожүйелеріне байланысты мәселелерді шешіп, мұхит тереңдігін зерттеу үшін инновациялық шешімдер жасайды. 🌎🤖\n\n🎯 Маусымдағы жұмыс мақсаты:\n\nБіз мұхит тереңдіктеріндегі тақырыптарға шомылып, мұхиттарға қатысты нақты мәселелерді шешу үшін технологияларды қалай пайдалану керектігін түсінеміз.\n\nҚатысушылар роботты құру бойынша жұмыс істейді, ол:\nМиссияларды орындау 🌊, суасты тапсырмаларына байланысты;\nМұхиттар мен теңіздердің практикалық мәселелерін шешу;\nМұхит тереңдіктерін қорғау және зерттеуге көмектесу.\n\n🤖 Роботтың маусымдағы тақырыбы:\n\nОсы маусымда роботтар суасты әлемін көрсететін алаңда жұмыс істейді, ол:\n\nРесурстарды іздеу және жинау 🐠;\nТеңіз жануарларын құтқару 🐙;\nСуасты станцияларын құру 🌐;\nТеңіз тереңдіктерін зерттеу 🐳 миссияларымен байланысты.\n\nКомандалар тек миссияларды орындай алатын роботты құрумен шектелмей, максималды ұпай жинау стратегиясын да ойластыруы керек.\n\n❓ Неліктен \"SUBMERGED\" атауы таңдалды?\n\n🔵 \"SUBMERGED\" суға терең сүңгуді білдіреді — теңіз тереңдіктеріне де, жаңа технологияларды меңгеруге де.\n\n🌊 Біз ғарыш туралы көп білеміз, бірақ суасты әлемі туралы аз білеміз! Сондықтан маусымның міндеті — қатысушыларды мұхиттануға қызықтыру және осы салада инновациялар жасау.\n\nБұл маусым ғылым мен технология табиғатты қорғауға және адамзаттың болашағы үшін жаңа шешімдер табуға көмектесе алатынын үйретеді. 💡\n\n🔗 Пайдалы сілтемелер:\nМаусымның бейне-анонсы — https://www.youtube.com/watch?v=c2f-Q5GGt2Q\n\n💡 Лайфхак: Жобамен жұмыс істей отырып, мұхитқа қатысты нақты мәселе туралы ойланыңыз. Бұл су тазартуға арналған шешім, теңіз тіршілігіне көмек немесе жаңа суасты жабдықтарын жасау болуы мүмкін.",
		"Роботқа арналған ресурстар": "FIRST LEGO League (FLL)-ге қатысу белгілі бір ресурстар мен қаржылық шығындарды талап етеді.\n\nБастаушы үшін қажетті жинақтар мен материалдарды түсіну, сондай-ақ қандай шығындар болатынын білу маңызды.\n\n🤖 Робот жасау ресурстары:\n\n1. LEGO® Education SPIKE™ Prime Set:\n• FLL-де роботты құрастыру және бағдарламалау үшін негізгі жиынтық.\n• Әртүрлі құрылыс элементтері, сенсорлар және интеллектуалды хаб бар.\n• LEGO Education ресми сайтынан сатып алуға қол жетімді:\n• LEGO Education SPIKE Prime Set https://education.lego.com/en-us/products/lego-education-spike-prime-set/45678/\n\n2. Қосымша ресурстар және нұсқаулар:\n• Техникалық ресурстар мен нұсқаулар FIRST сайтында қол жетімді:\n• Technical Resources - FIRST Inspires https://www.firstinspires.org/resource-library/fll/challenge/technical-resources\n\n🗺️ Маусым картасы және тапсырмалар:\n• Әрбір FLL маусымында жарыстарға арналған ерекше миссиялар мен алаң беріледі.\n\n💰 Жаңадан бастаушылар үшін шамамен шығындар:\n\n1. Команда тіркеу жарнасы:\n• Бағасы аймаққа және маусымға байланысты өзгеруі мүмкін.\n• Ағымдағы ақпаратты FIRST ресми сайтынан қарауға кеңес беріледі:\n• Pricing & Payment | FIRST LEGO League Challenge https://www.firstinspires.org/robotics/fll/challenge/pricing-and-payment\n\n2. LEGO Education SPIKE Prime жиынтығы:\n• Жинақ бағасы шамамен $400–$500.\n• Бұл жиынтық қайта пайдалануға болатын және келесі маусымдарда қолдануға жарамды.\n\n3. Қосымша материалдар:\n• Роботты жетілдіру үшін қосымша бөлшектер немесе аксессуарлар қажет болуы мүмкін.\n• Бұл шығындар шамамен $50–$100 құрайды.\n\n4. Көлік және басқа шығындар:\n• Жарыстарға қатысу үшін жол жүру, тұру және тамақтану шығындары қажет болуы мүмкін.\n• Бұл шығындар турнирлердің орналасқан жеріне және аймағыңыздан қашықтығына байланысты өзгереді.\n\n📺 Бастаушылар үшін пайдалы бейнелер:\n• SPIKE Prime жиынтығын пайдаланып, FLL роботының құрастыруы:\n•https://youtu.be/T6zzdw4CQ94?si=dKb362rheFupTin4\n\n• Бағдарламалау және құрастыру бойынша оқыту бейнелері:\n•https://youtube.com/playlist?list=PLu486RXmcQz-cWeGuPjVEKzaeRMGG9Rdv&si=OqJQ6_-Sv-QtQOtI\n\nFLL-ге қатысу білім беру және ғылым, технологиялар, инженерия және математика саласындағы дағдыларды дамытуға инвестиция болып табылады.\n\nБюджетті мұқият жоспарлау және дайындық командаңыздың маусымға сәтті қатысуына көмектеседі.\n\n🤖 KERNEY — Қазақстандағы FTC бөлшектеріне тапсырыс беру бойынша сенімді серіктес! 🇰🇿\n\nKERNEY компаниясы робототехникаға арналған жинақтарды Америкадан тікелей жеткізумен айналысады. LEGO SPIKE және басқа да танымал өндірушілерден бөлшектерді оңай тапсырыс бере аласыз.\n\n🔧 Неліктен KERNEY арқылы тапсырыс беру ыңғайлы?\n• Күрделі халықаралық жеткізілімге алаңдаудың қажеті жоқ.\n• Қазақстан бойынша жылдам жеткізу.\n• Роботтарды құрастыруға арналған түпнұсқа бөлшектердің кең таңдауы.",
		"Роботты қалай жинауға болады?": "🤖 FLL-ға арналған LEGO SPIKE Prime роботын қалай жинауға болады\n\nЕгер сіз робототехникада жаңа болсаңыз және LEGO SPIKE Prime-мен жұмыс істей бастасаңыз, уайымдамаңыз — негізгі роботты жинау және Scratch арқылы бағдарламалау оңай!\nСіздер үшін негізгі ақпарат пен пайдалы сілтемелер жинадық. ⬇️\n\n🛠 1-қадам: Негізгі роботты жинау\n\nАлдымен сіз миссияларды орындауға қабілетті негізгі роботты жинауыңыз керек.\n📺 FLL-ға арналған негізгі роботты жинау бойынша бейне-нұсқаулық:\n➡️ FLL Robot Tutorial (SPIKE Prime) https://youtu.be/T6zzdw4CQ94?si=cx0u7hw0sUMEWU9A\n\n💻 2-қадам: SPIKE қолданбасы арқылы бағдарламалау\n\nРоботты бағдарламалау үшін Scratch-подобный интерфейсін қолданатын LEGO Education SPIKE App қажет болады.\n\n📥 SPIKE қолданбасын жүктеп алыңыз\n\n🧩 SPIKE Prime үшін Scratch бағдарламалау қалай жұмыс істейді\n\nScratch — бұл бастаушылар үшін өте ыңғайлы визуалды бағдарламалау тілі.\n\n💡 Кеңес: Алдымен қозғалыс командаларын жасаңыз, содан кейін роботтың кедергілерді тануы және автоматты түрде тапсырмаларды орындауы үшін сенсорларды қолданыңыз.\n\n🤔 Негізгі робот үшін қандай бөлшектер қажет?\n\nСіздің негізгі роботқа мыналар кіруі керек:\n• Интеллектуалды хаб (SPIKE Prime Hub,EV3)\n• Дөңгелектерге арналған екі мотор\n• Кедергілерді анықтау үшін қашықтық сенсоры\n\n💸 FLL үшін роботты жинауға жалпы шығындар:\n• LEGO SPIKE Prime жинағы: шамамен $400–$500\n• Қосымша аксессуарлар мен сенсорлар: $50–$100\n\n🔗 Пайдалы сілтемелер:\n• LEGO Education SPIKE Prime — Ресми сайт: https://education.lego.com/en-us/products/lego-education-spike-prime-set/45678/\n\n🎯 Қорытынды:\n\n1️) Нұсқаулық немесе бейне-нұсқаулық арқылы негізгі роботты жинаңыз.\n2️) SPIKE қолданбасын баптаңыз және роботты қосыңыз.\n3️) Scratch-та бағдарламалауды бастаңыз, біртіндеп күрделілікті арттырыңыз.\nСіздің алғашқы роботыңыздың жинағында сәттілік! 🤖",
		"Инновациялық жоба": "🌊 FLL-дағы инновациялық жоба: “SUBMERGED” маусымы 2024-2025\n\n“SUBMERGED” маусымында командалар мұхиттар мен су ресурстарымен байланысты мәселелерді шешуге арналған инновациялық жобада жұмыс істейді. Қатысушылар суасты әлеміне еніп, технологиялар мұхит экожүйесін сақтауға және біздің планетамызды жақсартуға қалай көмектесетінін зерттейді.\n\n🎯 Инновациялық жобаның мақсаты:\n\nСу ресурстарын пайдалану немесе қорғау, суасты инфрақұрылымы немесе теңіз экожүйесімен байланысты нақты мәселені шешетін шешім жасау. Командалар адамдар мен қоршаған ортаға пайдалы инновация ойлап табуы керек.\nБұл келесідей болуы мүмкін:\n• 🌱 Суды тазартуға арналған технология\n• 🐠 Теңіз жануарларын қорғауға арналған шешім\n• 🚢 Суға қауіпсіз жұмыс жасауға арналған құрылғы\n• 🌊 Мұхиттардың ластануын азайтуға арналған жоба\n\n❓ FLL-дағы инновациялық жоба деген не?\n\nБұл команданың зерттеу жұмысы, оған мыналар кіреді:\n1️) Нақты мәселені анықтау.\n2️) Бар шешімдерді зерттеу және талдау.\n3) Өзінің инновациялық шешімін әзірлеу.\n4️) Судьяларға жобаның презентациясын дайындау.\n\n📋 “SUBMERGED” маусымының шарттары мен талаптары:\n1. Мәселені анықтау:\nСуасты зерттеулермен немесе суды пайдаланумен байланысты мәселені табыңыз. Бұл жаһандық немесе жергілікті мәселе болуы мүмкін.\n\n2. Бар шешімдерді зерттеу:\nҚандай технологиялар бар екенін қараңыз. Мысалы, су сүзу жүйелері, суасты дрондары, теңіз жануарларын бақылау тәсілдері.\n\n3. Инновацияны әзірлеу:\nСіздің шешіміңіз ерекше және пайдалы болуы керек. Бұл суды тазартудың жаңа әдісі, суасты өмірін бақылауға арналған құрылғы немесе ластануды азайту технологиясы болуы мүмкін.\n\n4. Презентация дайындау:\nКоманда судьяларға өз жобасын, мәселені, шешімді және оның адамдарға қалай көмектесетінін түсіндіруі керек.\n\n📚 Жобаның табысты болуына арналған лайфхактар:\n\n💡 Жергілікті фокус: Өзіңіздің аймағыңыздағы мәселені табыңыз — бұл жобаға бірегейлік қосады. Мысалы, егер сіздің қалаңызда суды тазарту немесе жағалаулармен байланысты проблемалар болса, мұны жоба үшін идея ретінде қолданыңыз.\n\n💡 Сарапшыларды тартыңыз: Экологтар, инженерлер немесе ғалымдар сияқты мамандарды жұмысыңызға қатыстырыңыз. Бұл жобаға көп маңыздылық береді.\n\n💡 Презентация: Шығармашылық және түсінікті презентация дайындаңыз. Постерлерді, слайдтарды немесе жобаны көрсету үшін роботты қолдануға болады.\n🌟 Инновациялық жобаның пайдасы:\n\nFLL-дағы инновациялық жоба балалар мен жасөспірімдерге сын тұрғысынан ойлау, инженерлік дағдылар мен креативтілікті дамытуға көмектеседі. Бұл жай конкурс үшін ғана емес, әлемді шын мәнінде жақсарту үшін атқарылған жұмыс.\n\nКомандалар қоғамдағы мәселелерді іздеп, ғылым мен технологияның көмегімен оларға шешім табуды үйренеді.\n\n📥 Пайдалы сілтемелер:\nЖобаны таныстыру нұсқаулығы — https://www.firstinspires.org/\n\nЕсіңізде болсын: Инновациялық жобаның басты мақсаты — идеяларыңыз бен технологияларыңыз арқылы әлемді жақсарту! 💙🌊",
		"Бізден кеңестер": "🔧 Роботқа арналған кеңес:\n\n“Роботты мүмкіндігінше жиі сынап көріңіз.”\nСоңғы минутқа дейін күтпеңіз! Жай роботпен басталып, оны біртіндеп жақсартыңыз. Миссияларды тұрақты орындағанына көз жеткізіңіз, тіпті үстел қисайған немесе беті тайғақ болған жағдайда. Әрбір сәтті сынақты бейнеге жазып, не жұмыс істейді, не жұмыс істемейді дегенді бақылаңыз.\n\n💡 Лайфхак:\nРобот базасына белгілер немесе сызықтар қосыңыз, сонда бірдеңе дұрыс болмай қалса, оны байқау оңай болады.\n\n🌱 Инновациялық жобаға арналған кеңес:\n\n“Сарапшылармен байланысыңыз!”\nСіз барлық нәрсені білуге міндетті емессіз. Нағыз мамандарды табыңыз (мысалы, инженерлер, экологтар, дәрігерлер) және оларға сұрақтар қойыңыз. Бұл судьяларға сіздің мәселені терең зерттегеніңізді көрсетеді.\n\n💡 Лайфхак:\nСарапшыларға LinkedIn немесе Instagram арқылы жазыңыз — көптеген адамдар мектеп жобаларына тегін көмектесуге дайын! Және кездесуді бейнеге түсіріп, судьяларға сарапшылардың цитаталарын көрсетіңіз.\n\n🤝 Командаға арналған кеңес:\n\n“Демалыс пен көңіл көтеруді жоспарлаңыз.”\nТым көп жұмыс — қажуға жол ашады. Демалыс жасап, бірге көңіл көтеруді ұмытпаңыз, бұл мотивацияны сақтауға көмектеседі. Бұл команда рухы үшін маңызды.\n\n💡 Лайфхак:\nЖиналыстарға күлкіге арналған бес минуттық немесе топтық ойындарды қосыңыз. Мысалы, айына бір рет ерекше нәрсе жасаңыз: пикник, мини-квест немесе FLL туралы мемдерге арналған жарыс.\n\n✨ Ең маңыздысы:\nРобот бұзылуы мүмкін, жоба өзгеруі мүмкін, бірақ егер команда ұйымшыл және көңілді болса — сіз сәттілікке жетесіз!",
		"Артқа⬅️": ""
	},
	"FTC": "1) Бұл не? \n2) Жүлделер\n3) 2024-2025 маусымы жайлы \n4) Роботқа арналған ресурстар\n5) Робот базасын қалай құрастыруға болады\n6) Outreach/Inspire \n7) Бізден кеңестер\n8) FTC терминологиясы",
  "FTCquestions": {
		"Бұл не?": "🤖 FTC (FIRST Tech Challenge) — бұл 12-18 жас аралығындағы мектеп оқушыларына арналған халықаралық робототехника сайысы және FIRST (For Inspiration and Recognition of Science and Technology) жаһандық қозғалысының бір бөлігі.\n\n🎯 FTC мақсаты — қатысушыларға инженерлік және бағдарламалау дағдыларын дамытуға, топта жұмыс істеуді, шынайы мәселелерді шешуді және технологияларды әлемді жақсарту үшін пайдалануды үйрету.\n\n🌍 Сайыстың ауқымы: 100+ елден 7000+ команда роботтарды құрып, аймақтық және халықаралық чемпионаттарда бақ сынайды.\n\n🚀 Болашаққа пайдасы: FTC-ға қатысу инженерия және IT саласында құнды дағдылар береді, стипендиялар алуға және технология саласындағы мансапқа дайындалуға көмектеседі. Қатысушылар әлемнің түкпір-түкпірінен сарапшылармен танысып, өз идеяларын жүзеге асыруды үйренеді.\n🔗 Толығырақ: www.firstinspires.org\n🔗 Көмек қажет болса, FIRST қауымдастығы әрдайым қолдау көрсетуге дайын! https://t.me/firstkazakhstan",

		"Жүлделер": "FTC-да жүлделер (Awards) және альянстар (Alliances) маусымы INTO THE DEEP 🎮\n\nFTC командаларды түрлі жетістіктері үшін марапаттайды, сонымен қатар сайыстардағы матчтардағы жетістіктері үшін де жүлделер беріледі. Міне барлық жүлде санаттары мен негізгі альянстар сипаттамалары:\n\n🏆 Inspire Award — ең беделді жүлде!\nБұл жүлде басқа командаларға үлгі бола алатын командаға беріледі. Олар инженерлік, бағдарламалау және топтық жұмыста ерекше қабілеттер көрсетеді.\n\n📚 Think Award\nИнженерлік портфолиода жобалау үдерісін жақсы құжаттаған командаға беріледі.\n\n🌐 Connect Award\nКәсіби мамандармен белсенді байланыс орнатып, өз жобасын нақты инженерлік мәселелермен байланыстыратын команда марапатталады.\n\n💡 Innovate Award\nРоботтың инновациялық дизайны немесе бірегей механизмдері үшін беріледі.\n\n🔥 Motivate Award\nFIRST-ке басқа адамдарды қатысуға шабыттандырған және өз білімдерін бөліскен командаға беріледі.\n\n⚙️ Control Award\nДатчиктерді, автономды функцияларды және бағдарламалық жасақтаманы тиімді пайдаланғаны үшін беріледі.\n\n🖌️ Design Award\nРоботтың ең жақсы өнеркәсіптік дизайнын көрсеткен командаға беріледі.\n\n🎗 Judges’ Award\nСудьялар басқа санаттарға сәйкес келмейтін ерекше жетістіктер үшін арнайы жүлде береді.\n\n🏅 Winner Alliance — Жеңіске жеткен альянс\nБұл альянс сайыстың соңғы матчтарын жеңеді. Альянс капитаны мен екі серіктес командадан тұрады.\n\n🥈 Finalist Alliance — Финалға жеткен альянс\nБұл альянс финалға дейін жеткен, бірақ шешуші матчтарда жеңіліс тапқан командалардан тұрады.\n\n📑 Маусымның ресми нұсқаулығы: Competition Manual https://firstinspires.blob.core.windows.net/ftc/2024-25/Competition-Manual.pdf\n📄 Маусым ресурстары: Game & Season Materials\nhttps://www.firstinspires.org/resource-library/ftc/game-and-season-info\nhttps://youtu.be/xvYBqL2bNSY?si=smAKKENeX5QNAPIn\n\n🏆 Альянстар — жеңістің кілті! Серіктестермен бірлесе жұмыс істеңіз және Winner Alliance құрамында тарихыңызды жазыңыз! 🚀",

		"2024-2025 маусымы туралы": "🌊 FTC 2024-2025 маусымы — INTO THE DEEP 🚀\n\nFIRST Tech Challenge жаңа маусымын ашты, ол мұхит және су астындағы әлемді зерттеу идеясына негізделген. Командаларға инженерлік және ғылыми міндеттерді шешіп, мұхиттарды зерттеуге және қоршаған ортаны қорғауға арналған робот құрастыру қажет.\n\n🎯 Маусымның мақсаты\nFIRST мұндай маусымдарды мектеп оқушыларын инженерия, бағдарламалау және ғылымды оқуға шабыттандыру үшін жасайды. Осы маусымда командалар су асты әлемінің мәселелерін зерттейді:\n🔹 Мұхиттарды технологиялар арқылы қалай зерттеуге болады?\n🔹 Роботтар теңіз экожүйесін құтқаруға қалай көмектеседі?\n🔹 Экологиялық мәселелерді шешуге қандай инновациялар жасалуы мүмкін?\n\n💡 FIRST технологиялар әлемді жақсарта алатынын көрсетуге тырысады. Әр маусым жаңа өзекті тақырыптарды ашады және командаларды нақты мәселелерге инженерлік шешімдер табуға үйретеді.\n\n🦾 Командалар не істейді?\n👉 Мұхит зерттеулерімен байланысты миссияларды орындай алатын робот құрастырады.\n👉 Engineering Portfolio-да барлық жұмыс процесін құжаттайды.\n👉 STEM саласындағы кәсіби мамандармен танысып, топтық жұмыс істеуді үйренеді.\n\n🌐 Неге бұл маңызды?\nINTO THE DEEP маусымы тек сайыстар туралы ғана емес, оқыту туралы:\n🔧 Командалар инженерлік міндеттерді шешуді үйренеді.\n📚 Қоршаған орта мәселелерін зерттейді және оларды шешу жолдарын іздейді.\n🌱 STEM мамандықтарында және өмірде қажетті дағдыларды дамытады.\n\n📄 Пайдалы сілтемелер:\n🔗 FIRST Tech Challenge ресми сайты https://www.firstinspires.org/robotics/ftc/game-and-season\n🔗 Маусымның құжаттары мен ресурстары https://www.firstinspires.org/resource-library/ftc/game-and-season-info\n🔗 INTO THE DEEP маусымының толық нұсқаулығы https://firstinspires.blob.core.windows.net/ftc/2024-25/Competition-Manual.pdf\n🌊 Технологиялардың тереңіне сүңгіп, FIRST-пен жаңа көкжиектерді ашыңыз!",
		"Робот үшін ресурстар": "FTC роботына арналған бөлшектерді қайдан сатып алуға болады?\n\n1) GoBilda\n🔗 https://www.gobilda.com/\nБұл ең танымал дүкендердің бірі. Мұнда шасси, дөңгелектер, сервомоторлар және басқа механикалық бөліктерді сатып алуға болады.\n\n💡 Не сатып алуға болады?\n\nhttps://www.gobilda.com/\n\n• Chassis Kits (қозғалтқыш негізі)\n• Viper-Slide Kits (көтергіштер)\n• Motion servo\n\n2) REV Robotics\n🔗 https://www.revrobotics.com/\nFTC-нің ресми серіктесі. Олар керемет контроллерлерді, моторларды және сенсорларды ұсынады. Әсіресе олардың Control Hub және Expansion Hub-ы — сіздің роботтың жүрегі.\n\n💡 Не сатып алуға болады?\n• Control & Power Bundle\n• Control Hub\n• Expansion Hub\n• Сенсорлар\n• Батареялар\n\n3) AndyMark\n🔗 https://www.andymark.com/\nМұнда дөңгелектер мен ерекше механизмдерді табуға болады. Стандартты емес бөлшектерді іздеу үшін осы жерге кіруге кеңес береміз.\n💡 Не сатып алуға болады?\n• Field element\n• SAR330 Aluminum Slide (misumi)\n\n💰 Бастапқы роботты жинау қанша тұрады?\n\n💸 Жаңадан бастаушыларға бюджет:\n• REV Kit: ~$700\n• Control & Power Bundle: ~$600-700\n📦 Барлығы: ~$1400-2000 базалық робот үшін\n\n🖥 3D басып шығару үшін робот\n\nЕгер роботқа бірегей бөлшектер қосқыңыз келсе, 3D-принтерді қолдануға болады.\n\n🖨️ FTC үшін 3D принтерді қайдан сатып алуға болады?\n\n🔎 Біз Ender 3 немесе Prusa i3 MK3S моделін ұсынамыз — бұл жаңадан бастаушылар мен тәжірибелі қолданушыларға арналған ең танымал үлгілер. Олар арзан, оңай орнатылады және робот бөлшектерін басып шығару үшін өте ыңғайлы.\n\n💻 Қайдан тапсырыс беру керек?\n\n1) Creality Official Store — Ender 3-ті өндірушіден тікелей тапсырыс бере аласыз. https://www.creality.com/\n2️) Amazon — ең жылдам тапсырыс беру нұсқасы. https://www.amazon.com/\n\n🧵 3D-принтерге арналған пластикті қайдан алу керек?\n\nПластик «филамент» деп аталады. Ең танымал түрлері — PLA және ABS.\n\n🎨 PLA (полилактид) — ең қарапайым және экологиялық пластик. Оны басып шығару оңай және күрделі баптауды қажет етпейді.\n🔥 ABS — берік пластик, бірақ ол жабық корпусты принтер мен желдетуді қажет етеді.\n\n🤖 KERNEU — Қазақстанда FTC бөлшектерін сенімді серіктес арқылы тапсырыс беру! 🇰🇿\n\nKERNEU компаниясы Америкадан робототехникаға арналған бөлшектерді жеткізуде маманданған. REV Robotics, GoBilda және басқа өндірушілердің бөлшектерін оңай тапсырыс беруге болады.\n\n🔧 Неге KERNEU арқылы тапсырыс беру ыңғайлы?\n• Халықаралық күрделі жеткізуге алаңдаудың қажеті жоқ.\n• Қазақстан бойынша тез жеткізу.\n• Роботтарды құрастыруға арналған түпнұсқа бөлшектердің үлкен таңдауы.\n\n🌐 KERNEU байланысы\n📱 Телефон: [8 747 606 1296]\n\n⚙️ KERNEU көмегімен командаңызды жетілдіріп, ең үздік роботтарды жинаңыз! 🚀",
		"Роботтың негізін қалай жинау керек": "FTC үшін роботтың негізін қалай жинауға болады? Бұл өз тәжірибемізге сүйене отырып тексерілген ақпарат, сондықтан бұл кеңестер сізге пайдалы болады. Төменде сілтемелер, кеңестер және жаңа бастаушыларға арналған оқу құралдары бар. Бастайық! 🚀\n\n🔧 1️) Шасси — кез келген роботтың негізі\n\nБіз GoBilda немесе REV компаниясының базалық шассиімен бастауды ұсынамыз.\nЕң танымал нұсқа — GoBilda-ның Strafer Chassis Kit, себебі ол дөңгелектер мен моторларды орнатуға дайын.\n\n💡 Кеңес: Mecanum Wheels бар шассиді бірден алған дұрыс, өйткені бұл роботтың барлық бағыттарда қозғалуға мүмкіндік береді. Бұл алаңда үлкен артықшылық береді.\n\n📺 Шасси жинау бойынша оқу құралы:\n🔗 https://youtu.be/dKG-_FvWQ7Q?si=rJOthjnvVZUz-KMk\n\n⚙️ 2️) Моторлар мен дөңгелектер\n\nHD Hex Motors пен Mecanum Wheels орнатуға кеңес береміз. Мұндай моторлар жақсы қуат пен жылдамдық береді.\n\n📺 Дөңгелектер мен моторларды орнату бойынша оқу құралы:\n🔗 Видео: https://youtube.com/playlist?list=PLnGKI6YfHs_-fQjXAj2DboGclWjR_RPZp&si=l_1edj2e32critpi\n\n🔋 3️) Электрониканы қосу\n\nREV Robotics компаниясының Control Hub қолдануды ұсынамыз. Бұл роботтағы барлық жабдықты біріктіретін әмбебап контроллер.\n\n📺 Электрониканы қосу бойынша оқу құралы:\n🔗 Видео: https://youtube.com/playlist?list=PLnGKI6YfHs_-fQjXAj2DboGclWjR_RPZp&si=l_1edj2e32critpi\n\n🖱️ 4️) Роботты бағдарламалау\n\nШассиді жинап, электрониканы қосқаннан кейін роботты бағдарламалау қажет. Егер сіз жаңадан бастасаңыз, FTC Blocks-тан бастауды немесе тәжірибеңіз болса, Java-ны пайдалануды ұсынамыз.\n\n💡 Біздің кеңестер:\n• Стандартты бекітпелерді 3D басып шығарылған бөлшектермен алмастырыңыз. Бұл роботты жеңіл және ыңғайлы етеді.\n• Металлдың орнына пластикалық немесе көміртекті элементтерді қолданыңыз. Бұл роботты жеңіл әрі жылдам етеді.\n• Батареялар мен зарядтағыштарға үнемдемеңіз! Бұл тұрақты жұмыс үшін маңызды.\n\n📦 Бөлшектерді тапсырыс беру ресурстары:\n🔗 GoBilda https://www.gobilda.com/\n🔗 REV Robotics https://www.revrobotics.com/\n🔗 AndyMark https://www.andymark.com/",
		"Outreach/Inspire": "🌍 Outreach (Таныстыру және шабыт беру)\n\nOutreach — бұл командаңыздың, роботтардың және Gracious Professionalism философиясының ақпаратын тарату процесі. Бұл FTC-нің маңызды аспектісі, себебі ол сіздің командаңыздың қауымдастыққа қаншалықты қатысатынын және басқаларға қалай көмектесетінін көрсетеді.\n\n📑 Outreach-та не болу керек:\n\n1️) Әлеуметтік желілер — Instagram, Facebook немесе TikTok-та жоба жұмысын бөлісіңіз.\n2️) Білім беру жобалары — мектеп оқушыларына немесе жазғы лагердегі балаларға шеберлік сабақтарын өткізу.\n3️) Басқа командалармен өзара әрекет — жаңа командаларға оқыту немесе техникалық мәселелерді шешуге көмектесу.\n4️) Еріктілік қызметі — ғылым, техника немесе робототехникамен байланысты іс-шараларға қатысу.\n\n📋 Біздің лайфхак:\nІс-шараларды алдын ала жоспарлап, Instagram және TikTok-та хэштегтерді пайдаланыңыз. Мысалы: #FTCOutreach, #STEMforAll. Бұл сіздің командаңызға және STEM білім беруіне назар аударады!\n\n🏆 Inspire Award (Шабыт сыйлығы)\n\nInspire — бұл робототехника, қатысу және техникалық әрі әлеуметтік көзқараспен шешім табуда айрықша үлес қосқан командаларға берілетін негізгі сыйлық. Inspire Award алу үшін, командаңыз тек робот құрудан көп нәрсе жасайтынын дәлелдеу маңызды. Олар шабыттандырады, үйретеді және басқаларға көмектеседі.\n\n📑 Inspire-та не болу керек:\n\n1️) Жобаның терең жұмысы — роботымыз нақты мәселені қалай шешетінін көрсетуіміз керек.\n2️) Командалық жұмыс — тек робот қана емес, команданың ішкі өзара әрекеті, қарым-қатынасы мен мәселелерді шешуі маңызды.\n3️) Мақсат, миссия және философия — робототехниканы қоғамды жақсарту үшін қалай қолданатыныңыз.\n\n📋 Біздің лайфхак:\nПортфолиоға жобаның басқаларға қалай әсер еткенін, әлеуметтік немесе білім беру мәселелерін қалай шешкеніңізді қосуды ұмытпаңыз. Бұл Inspire сыйлығына ие болу үшін керемет “жобаны” жасайды.\n\n🖼 Canva арқылы портфолио жасау:\n1️) Canva-да тіркелу — егер аккаунт жоқ болса, Canva.com сайтында тіркеліңіз. Бұл тегін!\n2️) Үлгіні таңдау — іздеу өрісіне “portfolio” деп жазып, үлгіні таңдаңыз.\n3️) Беттерді баптау — бөлімдерді қосыңыз:\n• Техникалық мәліметтер: Робот пен шешімдерді сипаттаңыз.\n• Жұмыс кезеңдері: Даму тарихын көрсетіңіз.\n• Outreach: Таныстыру іс-шаралары.\n4️) Графика мен мәтінді қосу — фотосуреттер мен робот сызбаларын енгізіңіз.\n5️) Жүктеп, бөлісіңіз — PDF немесе PNG форматында жүктеп алыңыз.",
		"Бізден кеңестер": "1. Роботтың 3D моделінен баста 🖥️: Құрастыруға кіріспес бұрын 3D CAD (Computer-Aided Design) робот моделін жасау маңызды. Бұл барлық бөлшектердің бірге қалай жұмыс істейтінін көруге және құрастыру барысында қателерден сақтануға көмектеседі. Tinkercad немесе Fusion 360 сияқты құралдарды пайдалану бөлшектерді дәлірек жобалауға және барлық компоненттердің үйлесімділігіне сенімді болуға мүмкіндік береді.\n\n2. Демалысты жоспарла 🧘: Демалысты жоспарлау — өнімділіктің кілті. Қалпына келу және демалыс үшін уақытты алдын ала жоспарлауға көз жеткізіңіз. Жақсы демалыс қиын мәселелерді шешуге ойыңды жинақтауға және энергияны сақтауға көмектеседі. Осылайша сіз әрқашан тыныштық сақтап, жаңа жетістіктерге дайын боласыз.\n\n3. Салмақты жеңілдету үшін инженерлік саңылауларды (holes) пайдалан ⚙️: Роботтың бөлшектерін жобалағанда, беріктікке әсер етпейтін жерлерде саңылаулар қосу жалпы салмақты азайтуға көмектеседі. Бұл маневрлік пен тиімділікте салмақ маңызды рөл атқаратын роботтар үшін өте маңызды. Салмақты азайту үшін, бірақ құрылымның беріктігін төмендетпеу үшін саңылаулар жасауға болатын жерлер туралы ойланыңыз.",
		"Глоссарий FTC": "1. FTC (FIRST Tech Challenge) 🚀 — Робототехника бойынша жарыстар, мұнда командалар белгілі бір тапсырмаларды орындау үшін роботтар жасайды.\n\n2. Sample — жинау және сұрыптау үшін ойын элементтері (шарлар).\n\n3. Basket — sample-ді ұпай алу үшін жеткізу қажет себет.\n\n4. Chamber — sample-ді уақытша сақтау және сұрыптау орны.\n\n5. CAD (Computer-Aided Design) 💻 — Робот пен оның компоненттерінің 3D модельдерін жасау үшін компьютерлік бағдарламаларды пайдалану.\n\n6. Gracious Professionalism 🤝 — Басқаларға құрметпен қарау, көмек көрсету және кәсіби түрде әрекет ету маңызды принцип.\n\n7. Drive Team 🏎️ — Жарыс кезінде роботты алаңда басқаратын команда. Құрамына жүргізуші, оператор және стратегтер кіреді.\n\n8. Pit 🔧 — Жарыстар алдында команда роботты дайындайтын, диагностика жасап, жақсартатын орын.\n\n9. Match 🏆 — Жарыстың кезеңі, мұнда екі команда өз роботтарымен бір-бірімен жарысады.\n\n10. Alliance 🤝🤖 — Ортақ мақсатқа жету үшін матчта бірге жұмыс істейтін екі команданың тобы.\n\n11. Autonomous Period ⏱️ — Матчтың робот алдын ала бағдарламаланған нұсқаулар бойынша өздігінен жұмыс істейтін бөлігі.\n\n12. Driver-Controlled Period 🎮 — Команда роботты қолмен басқаратын матчтың бөлігі.\n\n13. Award 🏅 — Inspire Award сияқты жетістіктер үшін команда алатын сыйлық.\n\n14. Outreach 🌍 — STEM-ді танымал ету, жаңа адамдарды тарту және басқаларға көмектесу үшін команданың қызметі.",
		"Артқа⬅️": ""
	}
}
